balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC710A.PIC
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC13" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100-100-100" edc:name="IPC13" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T9IP" edc:desc="" edc:mask="0x7" edc:name="T9IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INT3IP" edc:desc="" edc:mask="0x7" edc:name="INT3IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INT4IP" edc:desc="" edc:mask="0x7" edc:name="INT4IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2RXIP" edc:desc="" edc:mask="0x7" edc:name="C2RXIP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T9IP0" edc:desc="" edc:mask="0x1" edc:name="T9IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T9IP1" edc:desc="" edc:mask="0x1" edc:name="T9IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T9IP2" edc:desc="" edc:mask="0x1" edc:name="T9IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INT3IP0" edc:desc="" edc:mask="0x1" edc:name="INT3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3IP1" edc:desc="" edc:mask="0x1" edc:name="INT3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT3IP2" edc:desc="" edc:mask="0x1" edc:name="INT3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INT4IP0" edc:desc="" edc:mask="0x1" edc:name="INT4IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4IP1" edc:desc="" edc:mask="0x1" edc:name="INT4IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4IP2" edc:desc="" edc:mask="0x1" edc:name="INT4IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2RXIP0" edc:desc="" edc:mask="0x1" edc:name="C2RXIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2RXIP1" edc:desc="" edc:mask="0x1" edc:name="C2RXIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2RXIP2" edc:desc="" edc:mask="0x1" edc:name="C2RXIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn-nnn-nnn" edc:cname="IPC14" edc:desc="" edc:impl="0x777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----100-100-100" edc:name="IPC14" edc:nzwidth="0x10" edc:por="-----100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2IP" edc:desc="" edc:mask="0x7" edc:name="C2IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP" edc:desc="" edc:mask="0x7" edc:name="PWMIP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP" edc:desc="" edc:mask="0x7" edc:name="QEIIP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2IP0" edc:desc="" edc:mask="0x1" edc:name="C2IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2IP1" edc:desc="" edc:mask="0x1" edc:name="C2IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2IP2" edc:desc="" edc:mask="0x1" edc:name="C2IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP0" edc:desc="" edc:mask="0x1" edc:name="PWMIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP1" edc:desc="" edc:mask="0x1" edc:name="PWMIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWMIP2" edc:desc="" edc:mask="0x1" edc:name="PWMIP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP0" edc:desc="" edc:mask="0x1" edc:name="QEIIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP1" edc:desc="" edc:mask="0x1" edc:name="QEIIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIIP2" edc:desc="" edc:mask="0x1" edc:name="QEIIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-----nnn----" edc:cname="IPC15" edc:desc="" edc:impl="0x7070" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-----100----" edc:name="IPC15" edc:nzwidth="0x10" edc:por="-100-----100----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="FLTAIP" edc:desc="" edc:mask="0x7" edc:name="FLTAIP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DMA5IP0" edc:desc="" edc:mask="0x1" edc:name="DMA5IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA5IP1" edc:desc="" edc:mask="0x1" edc:name="DMA5IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA5IP2" edc:desc="" edc:mask="0x1" edc:name="DMA5IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="FLTAIP0" edc:desc="" edc:mask="0x1" edc:name="FLTAIP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTAIP1" edc:desc="" edc:mask="0x1" edc:name="FLTAIP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTAIP2" edc:desc="" edc:mask="0x1" edc:name="FLTAIP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
