balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC710A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="LATB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB12" edc:desc="" edc:mask="0x1" edc:name="LATB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-------nnnn-" edc:cname="TRISC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111-------1111-" edc:name="TRISC" edc:nzwidth="0x10" edc:por="1111-------1111-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="TRISC12" edc:desc="" edc:mask="0x1" edc:name="TRISC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC13" edc:desc="" edc:mask="0x1" edc:name="TRISC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC14" edc:desc="" edc:mask="0x1" edc:name="TRISC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-------nnnn-" edc:cname="PORTC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-------uuuu-" edc:name="PORTC" edc:nzwidth="0x10" edc:por="xxxx-------xxxx-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC14" edc:desc="" edc:mask="0x1" edc:name="RC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-------nnnn-" edc:cname="LATC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-------0000-" edc:name="LATC" edc:nzwidth="0x10" edc:por="0000-------0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TRISD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="TRISD" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISD0" edc:desc="" edc:mask="0x1" edc:name="TRISD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD1" edc:desc="" edc:mask="0x1" edc:name="TRISD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD2" edc:desc="" edc:mask="0x1" edc:name="TRISD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD3" edc:desc="" edc:mask="0x1" edc:name="TRISD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD4" edc:desc="" edc:mask="0x1" edc:name="TRISD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD5" edc:desc="" edc:mask="0x1" edc:name="TRISD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD6" edc:desc="" edc:mask="0x1" edc:name="TRISD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD7" edc:desc="" edc:mask="0x1" edc:name="TRISD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD8" edc:desc="" edc:mask="0x1" edc:name="TRISD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD9" edc:desc="" edc:mask="0x1" edc:name="TRISD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD10" edc:desc="" edc:mask="0x1" edc:name="TRISD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD11" edc:desc="" edc:mask="0x1" edc:name="TRISD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD12" edc:desc="" edc:mask="0x1" edc:name="TRISD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD13" edc:desc="" edc:mask="0x1" edc:name="TRISD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD14" edc:desc="" edc:mask="0x1" edc:name="TRISD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISD15" edc:desc="" edc:mask="0x1" edc:name="TRISD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="PORTD" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD8" edc:desc="" edc:mask="0x1" edc:name="RD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD9" edc:desc="" edc:mask="0x1" edc:name="RD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD10" edc:desc="" edc:mask="0x1" edc:name="RD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD11" edc:desc="" edc:mask="0x1" edc:name="RD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD12" edc:desc="" edc:mask="0x1" edc:name="RD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD13" edc:desc="" edc:mask="0x1" edc:name="RD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD14" edc:desc="" edc:mask="0x1" edc:name="RD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD15" edc:desc="" edc:mask="0x1" edc:name="RD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LATD" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="LATD" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD8" edc:desc="" edc:mask="0x1" edc:name="LATD8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD9" edc:desc="" edc:mask="0x1" edc:name="LATD9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD10" edc:desc="" edc:mask="0x1" edc:name="LATD10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD11" edc:desc="" edc:mask="0x1" edc:name="LATD11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD12" edc:desc="" edc:mask="0x1" edc:name="LATD12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD13" edc:desc="" edc:mask="0x1" edc:name="LATD13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD14" edc:desc="" edc:mask="0x1" edc:name="LATD14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD15" edc:desc="" edc:mask="0x1" edc:name="LATD15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATD" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
